#ifndef COLLECTIONS_H
#define COLLECTIONS_H

#include <QByteArray>
#include <Core/Libs/QComPortThread.h>

// ======================================================================
//  ***** Список результатов выполнения действий *****                       
// ======================================================================
enum EResultCodes {
  resOk = 0,
  resFail,
  resError
};

// ======================================================================
//  ***** Структура описывающая состав команд для отправки *****                       
// ======================================================================
struct SCommandDesc 
{
  QByteArray mCmdData;  // текст команды
  bool mRn;             // true: в конце команды добавляются символы \r\n
  bool mIsHex;          // true: команда отправляется в виде HEX данных
};

// ======================================================================
//  ***** Структура описывающая данные файла для отправки в порт ******                        
// ======================================================================
struct SFileSendDesc
{
  QString mFileName;    // абсолютный путь к файлу
};

#endif // COLLECTIONS_H
