#ifndef COLLECTIONS_H
#define COLLECTIONS_H

#include <QByteArray>

// ======================================================================
//  ***** Список результатов выполнения действий *****                       
// ======================================================================
enum EResultCodes {
  resOk = 0,
  resFail,
  resError
};

// ======================================================================
//  ***** Структура описывающая состав команд для отправки *****                       
// ======================================================================
struct SCommandDesc 
{
  QByteArray mCmdData;  // текст команды
  bool mRn;             // true: в конце команды добавляются символы \r\n
  bool mIsHex;          // true: команда отправляется в виде HEX данных
};

#endif // COLLECTIONS_H
