#include <QDebug>

#include "QMainClass.h"

// ======================================================================

QMainClass::QMainClass(int argc, char *argv[]) : 
	QSetupClass(argc, argv)
{
	mMainWindow = new QWinMainWindowTerminal();
}

// ======================================================================

QMainClass::~QMainClass()
{
	delete mMainWindow;	
}

// ======================================================================

// ======================================================================
//  protected                       
// ======================================================================

/**
	* @brief  Создает связку сигналов-слотов
	* @param  
	* @retval 
	*/
void QMainClass::makeSignalSlots()
{
	qDebug() << "Make signal slots";
}

// ======================================================================

/**
	* @brief  Инициализация компонентов для запуска приложения
	* @param  
	* @retval 
	*/
int QMainClass::setup()
{
	return 1;
}

// ======================================================================

/**
	* @brief  Запуск приложения
	* @param  
	* @retval 
	*/
int QMainClass::start()
{
	mMainWindow->show();
	return 1;
}

// ======================================================================
